app/Models/ProductoModel.php

INSERT INTO `producto` (`nombreproducto`, `detallesproducto`, `precioproducto`, `cantidadproducto`, `imagenproducto`) VALUES ('lll', 'de madera', '200', '2', '2.jpg')
---
    public function insertar($datos){
        $Producto = $this->db->table('producto');
        $Producto->insert($datos);

UPDATE `producto` SET `nombreproducto` = 'sofa de color ', `detallesproducto` = 'de color azul ', `precioproducto` = '100', `cantidadproducto` = '2', `imagenproducto` = ''
WHERE `idproducto` = '4'
---
    public function actualizar($data, $id) {
        $Producto = $this->db->table('producto');
        $Producto->set($data);
        $Producto->where('idproducto', $id);
        return $Producto->update();